Feature: Creating Comic Feature

Scenario: Създаване на обект комикс без въведени данни
    Given Админа е в началната страница
    When Натиска бутона за създаване на комикс
    And Отваря се страницата за създаване на комикс
    And Натискане на бутона за създаване на комикс
    Then Появява се съобщение "Въведете всички данни"

Scenario: Създаване на обект комикс само с едно въведено поле (title)
    Given Админа е в началната страница
    When Натиска бутона за създаване на комикс
    And Отваря се страницата за създаване на комикс
    And Въвежда в полето за title : "Batman"
    And Натискане на бутона за създаване на комикс
    Then Появява се съобщение "Въведете всички данни"
    
Scenario: Създаване на обект комикс само с едно въведено поле (id)
    Given Админа е в началната страница
    When Натиска бутона за създаване на комикс
    And Отваря се страницата за създаване на комикс
    And Въвежда в полето за id : "1234"
    And Натискане на бутона за създаване на комикс
    Then Появява се съобщение "Въведете всички данни"

Scenario: Създаване на комикс с всички въведени данни
    Given Админа е в началната страница
		When Натиска бутона за създаване на комикс
    And Отваря се страницата за създаване на комикс
    And Въвежда в полето за id : "1234"
    And Въвежда в полето за title : "Batman"
    And Натискане на бутона за създаване на комикс
    Then Появява се съобщение "Успешно създаване на комикс"
