Feature: Searching Comic Feature

Scenario: Търсене на комикс без въведени данни
    Given Потребителя се намира в началната страница
    When Натиска бутона за търсене на комикс
    And Отваря се прозореца за търсене на комикс
    And Кликане на бутона за търсене
    Then Показва се съобщение "Въведете данните за комикс"
    
Scenario: Търсене на комикс с въведени данни
    Given Потребителя се намира в началната страница
    When Натиска бутона за търсене на комикс
    And Отваря се прозореца за търсене на комикс
    And Въвеждане в полето id : "1234"
    And Въвеждане в полето title : "Batman"
    And Кликане на бутона за търсене
    Then Показват се получените данни
    
Scenario: Търсене на комикс с въведени данни, но без резултат
    Given Потребителя се намира в началната страница
    When Натиска бутона за търсене на комикс
    And Отваря се прозореца за търсене на комикс
    And Въвеждане в полето title : "Vatman"
    And Кликане на бутона за търсене
    Then Нищо не се показва
    
    
